"""
โปรแกรมคำนวณค่า BMI (20 คะแนน)

เขียนโปรแกรมที่ทำหน้าที่ดังนี้:

รับค่าน้ำหนัก (หน่วยเป็นกิโลกรัม)
รับค่าส่วนสูง (หน่วยเป็นเมตร)
คำนวณค่า BMI โดยใช้สูตร: BMI = น้ำหนัก / (ส่วนสูง²)
แสดงค่า BMI โดยกำหนดให้มีทศนิยม 1 ตำแหน่ง
แสดงระดับของค่า BMI ตามเกณฑ์ที่กำหนดด้านล่างนี้

เกณฑ์ระดับ BMI:

ต่ำกว่า 18.5: น้ำหนักต่ำกว่าเกณฑ์
18.5 - 24.9: น้ำหนักปกติ
25.0 - 29.9: น้ำหนักเกิน
30.0 ขึ้นไป: โรคอ้วน
"""
while True:
    try:
        kg = float(input("กรองน้ำหนัก :"))
        m = float(input("กรองส่วนสูง :"))

        if kg <= 0 or m <= 0:
            print("ต้องกรอกน้ำหนักและส่วนสูงต้องมากกว่า 0")
            continue
        break
    except ValueError:
        print("กรุณากรอกเฉพาะตัวเลขเท่านั้น")

bmi = kg / (m ** 2)

print(f"ค่า BMI ของคุณคือ :",bmi)

if bmi < 18.5:
    print("น้ำหนักต่ำกว่าเกณฑ์")
elif bmi >= 18.5 and bmi <= 24.9:
    print("น้ำหนักปกติ")
elif bmi >= 25.0 and bmi <= 29.9:
    print("น้ำหนักเกิน")
else:
    print("โรคอ้วน")